citys = ['阿尔山', '阿克苏', '阿拉善左旗', '阿勒泰', '安庆', '安顺', '鞍山', '巴彦淖尔', '百色', '包头', '保山', '北海', '白城',
	 '白山', '毕节', '博乐', '重庆', '昌都', '常德', '常州', '朝阳', '成都', '池州', '赤峰', '揭阳', '长春', '长沙', '长治', 
	 '承德', '沧源', '达县', '大理', '大连', '大庆', '大同', '丹东', '稻城', '东营', '敦煌', '芒市', '额济纳旗', '鄂尔多斯', 
	 '恩施', '二连浩特', '佛山', '福州', '抚远', '阜阳', '赣州', '格尔木', '固原', '广元', '广州', '贵阳', '桂林', '哈尔滨', 
	 '哈密', '海口', '海拉尔', '邯郸', '汉中', '杭州', '合肥', '和田', '黑河', '呼和浩特', '淮安', '怀化', '黄山', '惠州', 
	 '鸡西', '济南', '济宁', '加格达奇', '佳木斯', '嘉峪关', '金昌', '金门', '锦州', '嘉义', '西双版纳', '建三江', '晋江', 
	 '井冈山', '景德镇', '九江', '九寨沟', '喀什', '凯里', '康定', '克拉玛依', '库车', '库尔勒', '昆明', '拉萨', '兰州', 
	 '黎平', '丽江', '荔波', '连云港', '六盘水', '临汾', '林芝', '临沧', '临沂', '柳州', '泸州', '洛阳', '吕梁', '澜沧', 
	 '龙岩', '满洲里', '梅州', '绵阳', '漠河', '牡丹江', '马祖', '南昌', '南充', '南京', '南宁', '南通', '南阳', '宁波', 
	 '宁蒗', '攀枝花', '普洱', '齐齐哈尔', '黔江', '且末', '秦皇岛', '青岛', '庆阳', '衢州', '日喀则', '日照', '三亚', 
	 '厦门', '上海', '深圳', '神农架', '沈阳', '石家庄', '塔城', '台州', '太原', '扬州', '唐山', '腾冲', '天津', '天水', 
	 '通辽', '铜仁', '吐鲁番', '万州', '威海', '潍坊', '温州', '文山', '乌海', '乌兰浩特', '乌鲁木齐', '无锡', '梧州', 
	 '武汉', '武夷山', '西安', '西昌', '西宁', '锡林浩特', '香格里拉(迪庆)', '襄阳', '兴义', '徐州', '烟台', '延安', '延吉', 
	 '盐城', '伊春', '伊宁', '宜宾', '宜昌', '宜春', '义乌', '银川', '永州', '榆林', '玉树', '运城', '湛江', '张家界', 
	 '张家口', '张掖', '昭通', '郑州', '中卫', '舟山', '珠海', '遵义(茅台)', '遵义(新舟)']


time_limit = ['不限','2020-05-20','2020-05-21','2020-05-22','2020-05-23','2020-05-24','2020-05-25','2020-05-26',
	'2020-05-27','2020-05-28','2020-05-29','2020-05-30','2020-05-31','2020-06-01','2020-06-02','2020-06-03',]

airline_limit = ['不限','南方航空','中国联合航空','重庆航空','厦门航空','河北航空','首都航空','东方航空','中国国航','华夏航空',
	'吉祥航空','山东航空','东海航空','西藏航空']

price_limit = ['不限'] + [str(100*i) for i in range(1,201)]